testing/results/canvas-20260509-073239/k6-summary.txt

         /\      Grafana   /‾‾/  
    /\  /  \     |\  __   /  /   
   /  \/    \    | |/ /  /   ‾‾\ 
  /          \   |   (  |  (‾)  |
 / __________ \  |_|\_\  \_____/ 


     execution: local
        script: /home/ubuntu/canvas-k8s/testing/load_test/canvas-load.js
        output: Prometheus remote write (http://172.31.27.241:30090/api/v1/write)

     scenarios: (100.00%) 1 scenario, 10 max VUs, 5m30s max duration (incl. graceful stop):
              * default: 10 looping VUs for 5m0s (gracefulStop: 30s)


Run       [ 100% ] setup()
default   [   0% ]

running (0m02.0s), 10/10 VUs, 0 complete and 0 interrupted iterations
default   [   0% ] 10 VUs  0m00.3s/5m0s

running (0m03.0s), 10/10 VUs, 4 complete and 0 interrupted iterations
default   [   0% ] 10 VUs  0m01.3s/5m0s

running (0m04.0s), 10/10 VUs, 10 complete and 0 interrupted iterations
default   [   1% ] 10 VUs  0m02.3s/5m0s

running (0m05.0s), 10/10 VUs, 17 complete and 0 interrupted iterations
default   [   1% ] 10 VUs  0m03.3s/5m0s

running (0m06.0s), 10/10 VUs, 24 complete and 0 interrupted iterations
default   [   1% ] 10 VUs  0m04.3s/5m0s

running (0m07.0s), 10/10 VUs, 33 complete and 0 interrupted iterations
default   [   2% ] 10 VUs  0m05.3s/5m0s

running (0m08.0s), 10/10 VUs, 40 complete and 0 interrupted iterations
default   [   2% ] 10 VUs  0m06.3s/5m0s

running (0m09.0s), 10/10 VUs, 46 complete and 0 interrupted iterations
default   [   2% ] 10 VUs  0m07.3s/5m0s

running (0m10.0s), 10/10 VUs, 52 complete and 0 interrupted iterations
default   [   3% ] 10 VUs  0m08.3s/5m0s

running (0m11.0s), 10/10 VUs, 58 complete and 0 interrupted iterations
default   [   3% ] 10 VUs  0m09.3s/5m0s

running (0m12.0s), 10/10 VUs, 66 complete and 0 interrupted iterations
default   [   3% ] 10 VUs  0m10.3s/5m0s

running (0m13.0s), 10/10 VUs, 73 complete and 0 interrupted iterations
default   [   4% ] 10 VUs  0m11.3s/5m0s

running (0m14.0s), 10/10 VUs, 80 complete and 0 interrupted iterations
default   [   4% ] 10 VUs  0m12.3s/5m0s

running (0m15.0s), 10/10 VUs, 89 complete and 0 interrupted iterations
default   [   4% ] 10 VUs  0m13.3s/5m0s

running (0m16.0s), 10/10 VUs, 96 complete and 0 interrupted iterations
default   [   5% ] 10 VUs  0m14.3s/5m0s

running (0m17.0s), 10/10 VUs, 101 complete and 0 interrupted iterations
default   [   5% ] 10 VUs  0m15.3s/5m0s

running (0m18.0s), 10/10 VUs, 110 complete and 0 interrupted iterations
default   [   5% ] 10 VUs  0m16.3s/5m0s

running (0m19.0s), 10/10 VUs, 115 complete and 0 interrupted iterations
default   [   6% ] 10 VUs  0m17.3s/5m0s

running (0m20.0s), 10/10 VUs, 122 complete and 0 interrupted iterations
default   [   6% ] 10 VUs  0m18.3s/5m0s

running (0m21.0s), 10/10 VUs, 131 complete and 0 interrupted iterations
default   [   6% ] 10 VUs  0m19.3s/5m0s

running (0m22.0s), 10/10 VUs, 136 complete and 0 interrupted iterations
default   [   7% ] 10 VUs  0m20.3s/5m0s

running (0m23.0s), 10/10 VUs, 143 complete and 0 interrupted iterations
default   [   7% ] 10 VUs  0m21.3s/5m0s

running (0m24.0s), 10/10 VUs, 151 complete and 0 interrupted iterations
default   [   7% ] 10 VUs  0m22.3s/5m0s

running (0m25.0s), 10/10 VUs, 160 complete and 0 interrupted iterations
default   [   8% ] 10 VUs  0m23.3s/5m0s

running (0m26.0s), 10/10 VUs, 165 complete and 0 interrupted iterations
default   [   8% ] 10 VUs  0m24.3s/5m0s

running (0m27.0s), 10/10 VUs, 173 complete and 0 interrupted iterations
default   [   8% ] 10 VUs  0m25.3s/5m0s

running (0m28.0s), 10/10 VUs, 181 complete and 0 interrupted iterations
default   [   9% ] 10 VUs  0m26.3s/5m0s

running (0m29.0s), 10/10 VUs, 187 complete and 0 interrupted iterations
default   [   9% ] 10 VUs  0m27.3s/5m0s

running (0m30.0s), 10/10 VUs, 193 complete and 0 interrupted iterations
default   [   9% ] 10 VUs  0m28.3s/5m0s

running (0m31.0s), 10/10 VUs, 202 complete and 0 interrupted iterations
default   [  10% ] 10 VUs  0m29.3s/5m0s

running (0m32.0s), 10/10 VUs, 206 complete and 0 interrupted iterations
default   [  10% ] 10 VUs  0m30.3s/5m0s

running (0m33.0s), 10/10 VUs, 213 complete and 0 interrupted iterations
default   [  10% ] 10 VUs  0m31.3s/5m0s

running (0m34.0s), 10/10 VUs, 220 complete and 0 interrupted iterations
default   [  11% ] 10 VUs  0m32.3s/5m0s

running (0m35.0s), 10/10 VUs, 226 complete and 0 interrupted iterations
default   [  11% ] 10 VUs  0m33.3s/5m0s

running (0m36.0s), 10/10 VUs, 234 complete and 0 interrupted iterations
default   [  11% ] 10 VUs  0m34.3s/5m0s

running (0m37.0s), 10/10 VUs, 238 complete and 0 interrupted iterations
default   [  12% ] 10 VUs  0m35.3s/5m0s

running (0m38.0s), 10/10 VUs, 247 complete and 0 interrupted iterations
default   [  12% ] 10 VUs  0m36.3s/5m0s

running (0m39.0s), 10/10 VUs, 254 complete and 0 interrupted iterations
default   [  12% ] 10 VUs  0m37.3s/5m0s

running (0m40.0s), 10/10 VUs, 258 complete and 0 interrupted iterations
default   [  13% ] 10 VUs  0m38.3s/5m0s

running (0m41.0s), 10/10 VUs, 265 complete and 0 interrupted iterations
default   [  13% ] 10 VUs  0m39.3s/5m0s

running (0m42.0s), 10/10 VUs, 272 complete and 0 interrupted iterations
default   [  13% ] 10 VUs  0m40.3s/5m0s

running (0m43.0s), 10/10 VUs, 278 complete and 0 interrupted iterations
default   [  14% ] 10 VUs  0m41.3s/5m0s

running (0m44.0s), 10/10 VUs, 286 complete and 0 interrupted iterations
default   [  14% ] 10 VUs  0m42.3s/5m0s

running (0m45.0s), 10/10 VUs, 289 complete and 0 interrupted iterations
default   [  14% ] 10 VUs  0m43.3s/5m0s

running (0m46.0s), 10/10 VUs, 299 complete and 0 interrupted iterations
default   [  15% ] 10 VUs  0m44.3s/5m0s

running (0m47.0s), 10/10 VUs, 304 complete and 0 interrupted iterations
default   [  15% ] 10 VUs  0m45.3s/5m0s

running (0m48.0s), 10/10 VUs, 314 complete and 0 interrupted iterations
default   [  15% ] 10 VUs  0m46.3s/5m0s

running (0m49.0s), 10/10 VUs, 319 complete and 0 interrupted iterations
default   [  16% ] 10 VUs  0m47.3s/5m0s

running (0m50.0s), 10/10 VUs, 328 complete and 0 interrupted iterations
default   [  16% ] 10 VUs  0m48.3s/5m0s

running (0m51.0s), 10/10 VUs, 334 complete and 0 interrupted iterations
default   [  16% ] 10 VUs  0m49.3s/5m0s

running (0m52.0s), 10/10 VUs, 342 complete and 0 interrupted iterations
default   [  17% ] 10 VUs  0m50.3s/5m0s

running (0m53.0s), 10/10 VUs, 348 complete and 0 interrupted iterations
default   [  17% ] 10 VUs  0m51.3s/5m0s

running (0m54.0s), 10/10 VUs, 354 complete and 0 interrupted iterations
default   [  17% ] 10 VUs  0m52.3s/5m0s

running (0m55.0s), 10/10 VUs, 362 complete and 0 interrupted iterations
default   [  18% ] 10 VUs  0m53.3s/5m0s

running (0m56.0s), 10/10 VUs, 368 complete and 0 interrupted iterations
default   [  18% ] 10 VUs  0m54.3s/5m0s

running (0m57.0s), 10/10 VUs, 377 complete and 0 interrupted iterations
default   [  18% ] 10 VUs  0m55.3s/5m0s

running (0m58.0s), 10/10 VUs, 382 complete and 0 interrupted iterations
default   [  19% ] 10 VUs  0m56.3s/5m0s

running (0m59.0s), 10/10 VUs, 390 complete and 0 interrupted iterations
default   [  19% ] 10 VUs  0m57.3s/5m0s

running (1m00.0s), 10/10 VUs, 397 complete and 0 interrupted iterations
default   [  19% ] 10 VUs  0m58.3s/5m0s

running (1m01.0s), 10/10 VUs, 403 complete and 0 interrupted iterations
default   [  20% ] 10 VUs  0m59.3s/5m0s

running (1m02.0s), 10/10 VUs, 411 complete and 0 interrupted iterations
default   [  20% ] 10 VUs  1m00.3s/5m0s

running (1m03.0s), 10/10 VUs, 418 complete and 0 interrupted iterations
default   [  20% ] 10 VUs  1m01.3s/5m0s

running (1m04.0s), 10/10 VUs, 426 complete and 0 interrupted iterations
default   [  21% ] 10 VUs  1m02.3s/5m0s

running (1m05.0s), 10/10 VUs, 432 complete and 0 interrupted iterations
default   [  21% ] 10 VUs  1m03.3s/5m0s

running (1m06.0s), 10/10 VUs, 440 complete and 0 interrupted iterations
default   [  21% ] 10 VUs  1m04.3s/5m0s

running (1m07.0s), 10/10 VUs, 450 complete and 0 interrupted iterations
default   [  22% ] 10 VUs  1m05.3s/5m0s

running (1m08.0s), 10/10 VUs, 456 complete and 0 interrupted iterations
default   [  22% ] 10 VUs  1m06.3s/5m0s

running (1m09.0s), 10/10 VUs, 463 complete and 0 interrupted iterations
default   [  22% ] 10 VUs  1m07.3s/5m0s

running (1m10.0s), 10/10 VUs, 471 complete and 0 interrupted iterations
default   [  23% ] 10 VUs  1m08.3s/5m0s

running (1m11.0s), 10/10 VUs, 479 complete and 0 interrupted iterations
default   [  23% ] 10 VUs  1m09.3s/5m0s

running (1m12.0s), 10/10 VUs, 483 complete and 0 interrupted iterations
default   [  23% ] 10 VUs  1m10.3s/5m0s

running (1m13.0s), 10/10 VUs, 491 complete and 0 interrupted iterations
default   [  24% ] 10 VUs  1m11.3s/5m0s

running (1m14.0s), 10/10 VUs, 497 complete and 0 interrupted iterations
default   [  24% ] 10 VUs  1m12.3s/5m0s

running (1m15.0s), 10/10 VUs, 507 complete and 0 interrupted iterations
default   [  24% ] 10 VUs  1m13.3s/5m0s

running (1m16.0s), 10/10 VUs, 513 complete and 0 interrupted iterations
default   [  25% ] 10 VUs  1m14.3s/5m0s

running (1m17.0s), 10/10 VUs, 519 complete and 0 interrupted iterations
default   [  25% ] 10 VUs  1m15.3s/5m0s

running (1m18.0s), 10/10 VUs, 527 complete and 0 interrupted iterations
default   [  25% ] 10 VUs  1m16.3s/5m0s

running (1m19.0s), 10/10 VUs, 533 complete and 0 interrupted iterations
default   [  26% ] 10 VUs  1m17.3s/5m0s

running (1m20.0s), 10/10 VUs, 543 complete and 0 interrupted iterations
default   [  26% ] 10 VUs  1m18.3s/5m0s

running (1m21.0s), 10/10 VUs, 548 complete and 0 interrupted iterations
default   [  26% ] 10 VUs  1m19.3s/5m0s

running (1m22.0s), 10/10 VUs, 556 complete and 0 interrupted iterations
default   [  27% ] 10 VUs  1m20.3s/5m0s

running (1m23.0s), 10/10 VUs, 563 complete and 0 interrupted iterations
default   [  27% ] 10 VUs  1m21.3s/5m0s

running (1m24.0s), 10/10 VUs, 568 complete and 0 interrupted iterations
default   [  27% ] 10 VUs  1m22.3s/5m0s

running (1m25.0s), 10/10 VUs, 576 complete and 0 interrupted iterations
default   [  28% ] 10 VUs  1m23.3s/5m0s

running (1m26.0s), 10/10 VUs, 582 complete and 0 interrupted iterations
default   [  28% ] 10 VUs  1m24.3s/5m0s

running (1m27.0s), 10/10 VUs, 590 complete and 0 interrupted iterations
default   [  28% ] 10 VUs  1m25.3s/5m0s

running (1m28.0s), 10/10 VUs, 598 complete and 0 interrupted iterations
default   [  29% ] 10 VUs  1m26.3s/5m0s

running (1m29.0s), 10/10 VUs, 604 complete and 0 interrupted iterations
default   [  29% ] 10 VUs  1m27.3s/5m0s

running (1m30.0s), 10/10 VUs, 613 complete and 0 interrupted iterations
default   [  29% ] 10 VUs  1m28.3s/5m0s

running (1m31.0s), 10/10 VUs, 620 complete and 0 interrupted iterations
default   [  30% ] 10 VUs  1m29.3s/5m0s

running (1m32.0s), 10/10 VUs, 625 complete and 0 interrupted iterations
default   [  30% ] 10 VUs  1m30.3s/5m0s

running (1m33.0s), 10/10 VUs, 634 complete and 0 interrupted iterations
default   [  30% ] 10 VUs  1m31.3s/5m0s

running (1m34.0s), 10/10 VUs, 644 complete and 0 interrupted iterations
default   [  31% ] 10 VUs  1m32.3s/5m0s

running (1m35.0s), 10/10 VUs, 652 complete and 0 interrupted iterations
default   [  31% ] 10 VUs  1m33.3s/5m0s

running (1m36.0s), 10/10 VUs, 659 complete and 0 interrupted iterations
default   [  31% ] 10 VUs  1m34.3s/5m0s

running (1m37.0s), 10/10 VUs, 667 complete and 0 interrupted iterations
default   [  32% ] 10 VUs  1m35.3s/5m0s

running (1m38.0s), 10/10 VUs, 674 complete and 0 interrupted iterations
default   [  32% ] 10 VUs  1m36.3s/5m0s

running (1m39.0s), 10/10 VUs, 679 complete and 0 interrupted iterations
default   [  32% ] 10 VUs  1m37.3s/5m0s

running (1m40.0s), 10/10 VUs, 690 complete and 0 interrupted iterations
default   [  33% ] 10 VUs  1m38.3s/5m0s

running (1m41.0s), 10/10 VUs, 696 complete and 0 interrupted iterations
default   [  33% ] 10 VUs  1m39.3s/5m0s

running (1m42.0s), 10/10 VUs, 703 complete and 0 interrupted iterations
default   [  33% ] 10 VUs  1m40.3s/5m0s

running (1m43.0s), 10/10 VUs, 712 complete and 0 interrupted iterations
default   [  34% ] 10 VUs  1m41.3s/5m0s

running (1m44.0s), 10/10 VUs, 719 complete and 0 interrupted iterations
default   [  34% ] 10 VUs  1m42.3s/5m0s

running (1m45.0s), 10/10 VUs, 726 complete and 0 interrupted iterations
default   [  34% ] 10 VUs  1m43.3s/5m0s

running (1m46.0s), 10/10 VUs, 737 complete and 0 interrupted iterations
default   [  35% ] 10 VUs  1m44.3s/5m0s

running (1m47.0s), 10/10 VUs, 739 complete and 0 interrupted iterations
default   [  35% ] 10 VUs  1m45.3s/5m0s

running (1m48.0s), 10/10 VUs, 750 complete and 0 interrupted iterations
default   [  35% ] 10 VUs  1m46.3s/5m0s

running (1m49.0s), 10/10 VUs, 756 complete and 0 interrupted iterations
default   [  36% ] 10 VUs  1m47.3s/5m0s

running (1m50.0s), 10/10 VUs, 766 complete and 0 interrupted iterations
default   [  36% ] 10 VUs  1m48.3s/5m0s

running (1m51.0s), 10/10 VUs, 770 complete and 0 interrupted iterations
default   [  36% ] 10 VUs  1m49.3s/5m0s

running (1m52.0s), 10/10 VUs, 779 complete and 0 interrupted iterations
default   [  37% ] 10 VUs  1m50.3s/5m0s

running (1m53.0s), 10/10 VUs, 786 complete and 0 interrupted iterations
default   [  37% ] 10 VUs  1m51.3s/5m0s

running (1m54.0s), 10/10 VUs, 795 complete and 0 interrupted iterations
default   [  37% ] 10 VUs  1m52.3s/5m0s

running (1m55.0s), 10/10 VUs, 800 complete and 0 interrupted iterations
default   [  38% ] 10 VUs  1m53.3s/5m0s

running (1m56.0s), 10/10 VUs, 809 complete and 0 interrupted iterations
default   [  38% ] 10 VUs  1m54.3s/5m0s

running (1m57.0s), 10/10 VUs, 816 complete and 0 interrupted iterations
default   [  38% ] 10 VUs  1m55.3s/5m0s

running (1m58.0s), 10/10 VUs, 822 complete and 0 interrupted iterations
default   [  39% ] 10 VUs  1m56.3s/5m0s

running (1m59.0s), 10/10 VUs, 833 complete and 0 interrupted iterations
default   [  39% ] 10 VUs  1m57.3s/5m0s

running (2m00.0s), 10/10 VUs, 836 complete and 0 interrupted iterations
default   [  39% ] 10 VUs  1m58.3s/5m0s

running (2m01.0s), 10/10 VUs, 845 complete and 0 interrupted iterations
default   [  40% ] 10 VUs  1m59.3s/5m0s

running (2m02.0s), 10/10 VUs, 849 complete and 0 interrupted iterations
default   [  40% ] 10 VUs  2m00.3s/5m0s

running (2m03.0s), 10/10 VUs, 857 complete and 0 interrupted iterations
default   [  40% ] 10 VUs  2m01.3s/5m0s

running (2m04.0s), 10/10 VUs, 864 complete and 0 interrupted iterations
default   [  41% ] 10 VUs  2m02.3s/5m0s

running (2m05.0s), 10/10 VUs, 870 complete and 0 interrupted iterations
default   [  41% ] 10 VUs  2m03.3s/5m0s

running (2m06.0s), 10/10 VUs, 879 complete and 0 interrupted iterations
default   [  41% ] 10 VUs  2m04.3s/5m0s

running (2m07.0s), 10/10 VUs, 884 complete and 0 interrupted iterations
default   [  42% ] 10 VUs  2m05.3s/5m0s

running (2m08.0s), 10/10 VUs, 891 complete and 0 interrupted iterations
default   [  42% ] 10 VUs  2m06.3s/5m0s

running (2m09.0s), 10/10 VUs, 898 complete and 0 interrupted iterations
default   [  42% ] 10 VUs  2m07.3s/5m0s

running (2m10.0s), 10/10 VUs, 906 complete and 0 interrupted iterations
default   [  43% ] 10 VUs  2m08.3s/5m0s

running (2m11.0s), 10/10 VUs, 914 complete and 0 interrupted iterations
default   [  43% ] 10 VUs  2m09.3s/5m0s

running (2m12.0s), 10/10 VUs, 919 complete and 0 interrupted iterations
default   [  43% ] 10 VUs  2m10.3s/5m0s

running (2m13.0s), 10/10 VUs, 928 complete and 0 interrupted iterations
default   [  44% ] 10 VUs  2m11.3s/5m0s

running (2m14.0s), 10/10 VUs, 937 complete and 0 interrupted iterations
default   [  44% ] 10 VUs  2m12.3s/5m0s

running (2m15.0s), 10/10 VUs, 944 complete and 0 interrupted iterations
default   [  44% ] 10 VUs  2m13.3s/5m0s

running (2m16.0s), 10/10 VUs, 952 complete and 0 interrupted iterations
default   [  45% ] 10 VUs  2m14.3s/5m0s

running (2m17.0s), 10/10 VUs, 958 complete and 0 interrupted iterations
default   [  45% ] 10 VUs  2m15.3s/5m0s

running (2m18.0s), 10/10 VUs, 966 complete and 0 interrupted iterations
default   [  45% ] 10 VUs  2m16.3s/5m0s

running (2m19.0s), 10/10 VUs, 975 complete and 0 interrupted iterations
default   [  46% ] 10 VUs  2m17.3s/5m0s

running (2m20.0s), 10/10 VUs, 981 complete and 0 interrupted iterations
default   [  46% ] 10 VUs  2m18.3s/5m0s

running (2m21.0s), 10/10 VUs, 989 complete and 0 interrupted iterations
default   [  46% ] 10 VUs  2m19.3s/5m0s

running (2m22.0s), 10/10 VUs, 997 complete and 0 interrupted iterations
default   [  47% ] 10 VUs  2m20.3s/5m0s

running (2m23.0s), 10/10 VUs, 1003 complete and 0 interrupted iterations
default   [  47% ] 10 VUs  2m21.3s/5m0s

running (2m24.0s), 10/10 VUs, 1013 complete and 0 interrupted iterations
default   [  47% ] 10 VUs  2m22.3s/5m0s

running (2m25.0s), 10/10 VUs, 1018 complete and 0 interrupted iterations
default   [  48% ] 10 VUs  2m23.3s/5m0s

running (2m26.0s), 10/10 VUs, 1026 complete and 0 interrupted iterations
default   [  48% ] 10 VUs  2m24.3s/5m0s

running (2m27.0s), 10/10 VUs, 1036 complete and 0 interrupted iterations
default   [  48% ] 10 VUs  2m25.3s/5m0s

running (2m28.0s), 10/10 VUs, 1039 complete and 0 interrupted iterations
default   [  49% ] 10 VUs  2m26.3s/5m0s

running (2m29.0s), 10/10 VUs, 1049 complete and 0 interrupted iterations
default   [  49% ] 10 VUs  2m27.3s/5m0s

running (2m30.0s), 10/10 VUs, 1055 complete and 0 interrupted iterations
default   [  49% ] 10 VUs  2m28.3s/5m0s

running (2m31.0s), 10/10 VUs, 1064 complete and 0 interrupted iterations
default   [  50% ] 10 VUs  2m29.3s/5m0s

running (2m32.0s), 10/10 VUs, 1073 complete and 0 interrupted iterations
default   [  50% ] 10 VUs  2m30.3s/5m0s

running (2m33.0s), 10/10 VUs, 1078 complete and 0 interrupted iterations
default   [  50% ] 10 VUs  2m31.3s/5m0s

running (2m34.0s), 10/10 VUs, 1087 complete and 0 interrupted iterations
default   [  51% ] 10 VUs  2m32.3s/5m0s

running (2m35.0s), 10/10 VUs, 1094 complete and 0 interrupted iterations
default   [  51% ] 10 VUs  2m33.3s/5m0s

running (2m36.0s), 10/10 VUs, 1102 complete and 0 interrupted iterations
default   [  51% ] 10 VUs  2m34.3s/5m0s

running (2m37.0s), 10/10 VUs, 1109 complete and 0 interrupted iterations
default   [  52% ] 10 VUs  2m35.3s/5m0s

running (2m38.0s), 10/10 VUs, 1115 complete and 0 interrupted iterations
default   [  52% ] 10 VUs  2m36.3s/5m0s

running (2m39.0s), 10/10 VUs, 1123 complete and 0 interrupted iterations
default   [  52% ] 10 VUs  2m37.3s/5m0s

running (2m40.0s), 10/10 VUs, 1131 complete and 0 interrupted iterations
default   [  53% ] 10 VUs  2m38.3s/5m0s

running (2m41.0s), 10/10 VUs, 1138 complete and 0 interrupted iterations
default   [  53% ] 10 VUs  2m39.3s/5m0s

running (2m42.0s), 10/10 VUs, 1145 complete and 0 interrupted iterations
default   [  53% ] 10 VUs  2m40.3s/5m0s

running (2m43.0s), 10/10 VUs, 1152 complete and 0 interrupted iterations
default   [  54% ] 10 VUs  2m41.3s/5m0s

running (2m44.0s), 10/10 VUs, 1160 complete and 0 interrupted iterations
default   [  54% ] 10 VUs  2m42.3s/5m0s

running (2m45.0s), 10/10 VUs, 1168 complete and 0 interrupted iterations
default   [  54% ] 10 VUs  2m43.3s/5m0s

running (2m46.0s), 10/10 VUs, 1175 complete and 0 interrupted iterations
default   [  55% ] 10 VUs  2m44.3s/5m0s

running (2m47.0s), 10/10 VUs, 1182 complete and 0 interrupted iterations
default   [  55% ] 10 VUs  2m45.3s/5m0s

running (2m48.0s), 10/10 VUs, 1190 complete and 0 interrupted iterations
default   [  55% ] 10 VUs  2m46.3s/5m0s

running (2m49.0s), 10/10 VUs, 1198 complete and 0 interrupted iterations
default   [  56% ] 10 VUs  2m47.3s/5m0s

running (2m50.0s), 10/10 VUs, 1205 complete and 0 interrupted iterations
default   [  56% ] 10 VUs  2m48.3s/5m0s

running (2m51.0s), 10/10 VUs, 1215 complete and 0 interrupted iterations
default   [  56% ] 10 VUs  2m49.3s/5m0s

running (2m52.0s), 10/10 VUs, 1222 complete and 0 interrupted iterations
default   [  57% ] 10 VUs  2m50.3s/5m0s

running (2m53.0s), 10/10 VUs, 1231 complete and 0 interrupted iterations
default   [  57% ] 10 VUs  2m51.3s/5m0s

running (2m54.0s), 10/10 VUs, 1241 complete and 0 interrupted iterations
default   [  57% ] 10 VUs  2m52.3s/5m0s

running (2m55.0s), 10/10 VUs, 1244 complete and 0 interrupted iterations
default   [  58% ] 10 VUs  2m53.3s/5m0s

running (2m56.0s), 10/10 VUs, 1251 complete and 0 interrupted iterations
default   [  58% ] 10 VUs  2m54.3s/5m0s

running (2m57.0s), 10/10 VUs, 1259 complete and 0 interrupted iterations
default   [  58% ] 10 VUs  2m55.3s/5m0s

running (2m58.0s), 10/10 VUs, 1266 complete and 0 interrupted iterations
default   [  59% ] 10 VUs  2m56.3s/5m0s

running (2m59.0s), 10/10 VUs, 1272 complete and 0 interrupted iterations
default   [  59% ] 10 VUs  2m57.3s/5m0s

running (3m00.0s), 10/10 VUs, 1280 complete and 0 interrupted iterations
default   [  59% ] 10 VUs  2m58.3s/5m0s

running (3m01.0s), 10/10 VUs, 1286 complete and 0 interrupted iterations
default   [  60% ] 10 VUs  2m59.3s/5m0s

running (3m02.0s), 10/10 VUs, 1295 complete and 0 interrupted iterations
default   [  60% ] 10 VUs  3m00.3s/5m0s

running (3m03.0s), 10/10 VUs, 1300 complete and 0 interrupted iterations
default   [  60% ] 10 VUs  3m01.3s/5m0s

running (3m04.0s), 10/10 VUs, 1309 complete and 0 interrupted iterations
default   [  61% ] 10 VUs  3m02.3s/5m0s

running (3m05.0s), 10/10 VUs, 1318 complete and 0 interrupted iterations
default   [  61% ] 10 VUs  3m03.3s/5m0s

running (3m06.0s), 10/10 VUs, 1325 complete and 0 interrupted iterations
default   [  61% ] 10 VUs  3m04.3s/5m0s

running (3m07.0s), 10/10 VUs, 1330 complete and 0 interrupted iterations
default   [  62% ] 10 VUs  3m05.3s/5m0s

running (3m08.0s), 10/10 VUs, 1341 complete and 0 interrupted iterations
default   [  62% ] 10 VUs  3m06.3s/5m0s

running (3m09.0s), 10/10 VUs, 1344 complete and 0 interrupted iterations
default   [  62% ] 10 VUs  3m07.3s/5m0s

running (3m10.0s), 10/10 VUs, 1355 complete and 0 interrupted iterations
default   [  63% ] 10 VUs  3m08.3s/5m0s

running (3m11.0s), 10/10 VUs, 1360 complete and 0 interrupted iterations
default   [  63% ] 10 VUs  3m09.3s/5m0s

running (3m12.0s), 10/10 VUs, 1367 complete and 0 interrupted iterations
default   [  63% ] 10 VUs  3m10.3s/5m0s

running (3m13.0s), 10/10 VUs, 1375 complete and 0 interrupted iterations
default   [  64% ] 10 VUs  3m11.3s/5m0s

running (3m14.0s), 10/10 VUs, 1383 complete and 0 interrupted iterations
default   [  64% ] 10 VUs  3m12.3s/5m0s

running (3m15.0s), 10/10 VUs, 1389 complete and 0 interrupted iterations
default   [  64% ] 10 VUs  3m13.3s/5m0s

running (3m16.0s), 10/10 VUs, 1395 complete and 0 interrupted iterations
default   [  65% ] 10 VUs  3m14.3s/5m0s

running (3m17.0s), 10/10 VUs, 1403 complete and 0 interrupted iterations
default   [  65% ] 10 VUs  3m15.3s/5m0s

running (3m18.0s), 10/10 VUs, 1412 complete and 0 interrupted iterations
default   [  65% ] 10 VUs  3m16.3s/5m0s

running (3m19.0s), 10/10 VUs, 1420 complete and 0 interrupted iterations
default   [  66% ] 10 VUs  3m17.3s/5m0s

running (3m20.0s), 10/10 VUs, 1427 complete and 0 interrupted iterations
default   [  66% ] 10 VUs  3m18.3s/5m0s

running (3m21.0s), 10/10 VUs, 1433 complete and 0 interrupted iterations
default   [  66% ] 10 VUs  3m19.3s/5m0s

running (3m22.0s), 10/10 VUs, 1440 complete and 0 interrupted iterations
default   [  67% ] 10 VUs  3m20.3s/5m0s

running (3m23.0s), 10/10 VUs, 1448 complete and 0 interrupted iterations
default   [  67% ] 10 VUs  3m21.3s/5m0s

running (3m24.0s), 10/10 VUs, 1454 complete and 0 interrupted iterations
default   [  67% ] 10 VUs  3m22.3s/5m0s

running (3m25.0s), 10/10 VUs, 1460 complete and 0 interrupted iterations
default   [  68% ] 10 VUs  3m23.3s/5m0s

running (3m26.0s), 10/10 VUs, 1468 complete and 0 interrupted iterations
default   [  68% ] 10 VUs  3m24.3s/5m0s

running (3m27.0s), 10/10 VUs, 1476 complete and 0 interrupted iterations
default   [  68% ] 10 VUs  3m25.3s/5m0s

running (3m28.0s), 10/10 VUs, 1483 complete and 0 interrupted iterations
default   [  69% ] 10 VUs  3m26.3s/5m0s

running (3m29.0s), 10/10 VUs, 1489 complete and 0 interrupted iterations
default   [  69% ] 10 VUs  3m27.3s/5m0s

running (3m30.0s), 10/10 VUs, 1496 complete and 0 interrupted iterations
default   [  69% ] 10 VUs  3m28.3s/5m0s

running (3m31.0s), 10/10 VUs, 1503 complete and 0 interrupted iterations
default   [  70% ] 10 VUs  3m29.3s/5m0s

running (3m32.0s), 10/10 VUs, 1511 complete and 0 interrupted iterations
default   [  70% ] 10 VUs  3m30.3s/5m0s

running (3m33.0s), 10/10 VUs, 1516 complete and 0 interrupted iterations
default   [  70% ] 10 VUs  3m31.3s/5m0s

running (3m34.0s), 10/10 VUs, 1523 complete and 0 interrupted iterations
default   [  71% ] 10 VUs  3m32.3s/5m0s

running (3m35.0s), 10/10 VUs, 1530 complete and 0 interrupted iterations
default   [  71% ] 10 VUs  3m33.3s/5m0s

running (3m36.0s), 10/10 VUs, 1537 complete and 0 interrupted iterations
default   [  71% ] 10 VUs  3m34.3s/5m0s

running (3m37.0s), 10/10 VUs, 1547 complete and 0 interrupted iterations
default   [  72% ] 10 VUs  3m35.3s/5m0s

running (3m38.0s), 10/10 VUs, 1554 complete and 0 interrupted iterations
default   [  72% ] 10 VUs  3m36.3s/5m0s

running (3m39.0s), 10/10 VUs, 1562 complete and 0 interrupted iterations
default   [  72% ] 10 VUs  3m37.3s/5m0s

running (3m40.0s), 10/10 VUs, 1568 complete and 0 interrupted iterations
default   [  73% ] 10 VUs  3m38.3s/5m0s

running (3m41.0s), 10/10 VUs, 1575 complete and 0 interrupted iterations
default   [  73% ] 10 VUs  3m39.3s/5m0s

running (3m42.0s), 10/10 VUs, 1582 complete and 0 interrupted iterations
default   [  73% ] 10 VUs  3m40.3s/5m0s

running (3m43.0s), 10/10 VUs, 1591 complete and 0 interrupted iterations
default   [  74% ] 10 VUs  3m41.3s/5m0s

running (3m44.0s), 10/10 VUs, 1599 complete and 0 interrupted iterations
default   [  74% ] 10 VUs  3m42.3s/5m0s

running (3m45.0s), 10/10 VUs, 1605 complete and 0 interrupted iterations
default   [  74% ] 10 VUs  3m43.3s/5m0s

running (3m46.0s), 10/10 VUs, 1616 complete and 0 interrupted iterations
default   [  75% ] 10 VUs  3m44.3s/5m0s

running (3m47.0s), 10/10 VUs, 1621 complete and 0 interrupted iterations
default   [  75% ] 10 VUs  3m45.3s/5m0s

running (3m48.0s), 10/10 VUs, 1630 complete and 0 interrupted iterations
default   [  75% ] 10 VUs  3m46.3s/5m0s

running (3m49.0s), 10/10 VUs, 1636 complete and 0 interrupted iterations
default   [  76% ] 10 VUs  3m47.3s/5m0s

running (3m50.0s), 10/10 VUs, 1645 complete and 0 interrupted iterations
default   [  76% ] 10 VUs  3m48.3s/5m0s

running (3m51.0s), 10/10 VUs, 1652 complete and 0 interrupted iterations
default   [  76% ] 10 VUs  3m49.3s/5m0s

running (3m52.0s), 10/10 VUs, 1659 complete and 0 interrupted iterations
default   [  77% ] 10 VUs  3m50.3s/5m0s

running (3m53.0s), 10/10 VUs, 1665 complete and 0 interrupted iterations
default   [  77% ] 10 VUs  3m51.3s/5m0s

running (3m54.0s), 10/10 VUs, 1673 complete and 0 interrupted iterations
default   [  77% ] 10 VUs  3m52.3s/5m0s

running (3m55.0s), 10/10 VUs, 1682 complete and 0 interrupted iterations
default   [  78% ] 10 VUs  3m53.3s/5m0s

running (3m56.0s), 10/10 VUs, 1689 complete and 0 interrupted iterations
default   [  78% ] 10 VUs  3m54.3s/5m0s

running (3m57.0s), 10/10 VUs, 1696 complete and 0 interrupted iterations
default   [  78% ] 10 VUs  3m55.3s/5m0s

running (3m58.0s), 10/10 VUs, 1706 complete and 0 interrupted iterations
default   [  79% ] 10 VUs  3m56.3s/5m0s

running (3m59.0s), 10/10 VUs, 1711 complete and 0 interrupted iterations
default   [  79% ] 10 VUs  3m57.3s/5m0s

running (4m00.0s), 10/10 VUs, 1717 complete and 0 interrupted iterations
default   [  79% ] 10 VUs  3m58.3s/5m0s

running (4m01.0s), 10/10 VUs, 1724 complete and 0 interrupted iterations
default   [  80% ] 10 VUs  3m59.3s/5m0s

running (4m02.0s), 10/10 VUs, 1732 complete and 0 interrupted iterations
default   [  80% ] 10 VUs  4m00.3s/5m0s

running (4m03.0s), 10/10 VUs, 1739 complete and 0 interrupted iterations
default   [  80% ] 10 VUs  4m01.3s/5m0s

running (4m04.0s), 10/10 VUs, 1748 complete and 0 interrupted iterations
default   [  81% ] 10 VUs  4m02.3s/5m0s

running (4m05.0s), 10/10 VUs, 1751 complete and 0 interrupted iterations
default   [  81% ] 10 VUs  4m03.3s/5m0s

running (4m06.0s), 10/10 VUs, 1760 complete and 0 interrupted iterations
default   [  81% ] 10 VUs  4m04.3s/5m0s

running (4m07.0s), 10/10 VUs, 1768 complete and 0 interrupted iterations
default   [  82% ] 10 VUs  4m05.3s/5m0s

running (4m08.0s), 10/10 VUs, 1773 complete and 0 interrupted iterations
default   [  82% ] 10 VUs  4m06.3s/5m0s

running (4m09.0s), 10/10 VUs, 1782 complete and 0 interrupted iterations
default   [  82% ] 10 VUs  4m07.3s/5m0s

running (4m10.0s), 10/10 VUs, 1790 complete and 0 interrupted iterations
default   [  83% ] 10 VUs  4m08.3s/5m0s

running (4m11.0s), 10/10 VUs, 1798 complete and 0 interrupted iterations
default   [  83% ] 10 VUs  4m09.3s/5m0s

running (4m12.0s), 10/10 VUs, 1804 complete and 0 interrupted iterations
default   [  83% ] 10 VUs  4m10.3s/5m0s

running (4m13.0s), 10/10 VUs, 1812 complete and 0 interrupted iterations
default   [  84% ] 10 VUs  4m11.3s/5m0s

running (4m14.0s), 10/10 VUs, 1816 complete and 0 interrupted iterations
default   [  84% ] 10 VUs  4m12.3s/5m0s

running (4m15.0s), 10/10 VUs, 1825 complete and 0 interrupted iterations
default   [  84% ] 10 VUs  4m13.3s/5m0s

running (4m16.0s), 10/10 VUs, 1832 complete and 0 interrupted iterations
default   [  85% ] 10 VUs  4m14.3s/5m0s

running (4m17.0s), 10/10 VUs, 1838 complete and 0 interrupted iterations
default   [  85% ] 10 VUs  4m15.3s/5m0s

running (4m18.0s), 10/10 VUs, 1844 complete and 0 interrupted iterations
default   [  85% ] 10 VUs  4m16.3s/5m0s

running (4m19.0s), 10/10 VUs, 1854 complete and 0 interrupted iterations
default   [  86% ] 10 VUs  4m17.3s/5m0s

running (4m20.0s), 10/10 VUs, 1857 complete and 0 interrupted iterations
default   [  86% ] 10 VUs  4m18.3s/5m0s

running (4m21.0s), 10/10 VUs, 1867 complete and 0 interrupted iterations
default   [  86% ] 10 VUs  4m19.3s/5m0s

running (4m22.0s), 10/10 VUs, 1873 complete and 0 interrupted iterations
default   [  87% ] 10 VUs  4m20.3s/5m0s

running (4m23.0s), 10/10 VUs, 1881 complete and 0 interrupted iterations
default   [  87% ] 10 VUs  4m21.3s/5m0s

running (4m24.0s), 10/10 VUs, 1888 complete and 0 interrupted iterations
default   [  87% ] 10 VUs  4m22.3s/5m0s

running (4m25.0s), 10/10 VUs, 1894 complete and 0 interrupted iterations
default   [  88% ] 10 VUs  4m23.3s/5m0s

running (4m26.0s), 10/10 VUs, 1901 complete and 0 interrupted iterations
default   [  88% ] 10 VUs  4m24.3s/5m0s

running (4m27.0s), 10/10 VUs, 1908 complete and 0 interrupted iterations
default   [  88% ] 10 VUs  4m25.3s/5m0s

running (4m28.0s), 10/10 VUs, 1914 complete and 0 interrupted iterations
default   [  89% ] 10 VUs  4m26.3s/5m0s

running (4m29.0s), 10/10 VUs, 1923 complete and 0 interrupted iterations
default   [  89% ] 10 VUs  4m27.3s/5m0s

running (4m30.0s), 10/10 VUs, 1929 complete and 0 interrupted iterations
default   [  89% ] 10 VUs  4m28.3s/5m0s

running (4m31.0s), 10/10 VUs, 1939 complete and 0 interrupted iterations
default   [  90% ] 10 VUs  4m29.3s/5m0s

running (4m32.0s), 10/10 VUs, 1947 complete and 0 interrupted iterations
default   [  90% ] 10 VUs  4m30.3s/5m0s

running (4m33.0s), 10/10 VUs, 1955 complete and 0 interrupted iterations
default   [  90% ] 10 VUs  4m31.3s/5m0s

running (4m34.0s), 10/10 VUs, 1962 complete and 0 interrupted iterations
default   [  91% ] 10 VUs  4m32.3s/5m0s

running (4m35.0s), 10/10 VUs, 1970 complete and 0 interrupted iterations
default   [  91% ] 10 VUs  4m33.3s/5m0s

running (4m36.0s), 10/10 VUs, 1977 complete and 0 interrupted iterations
default   [  91% ] 10 VUs  4m34.3s/5m0s

running (4m37.0s), 10/10 VUs, 1984 complete and 0 interrupted iterations
default   [  92% ] 10 VUs  4m35.3s/5m0s

running (4m38.0s), 10/10 VUs, 1990 complete and 0 interrupted iterations
default   [  92% ] 10 VUs  4m36.3s/5m0s

running (4m39.0s), 10/10 VUs, 1997 complete and 0 interrupted iterations
default   [  92% ] 10 VUs  4m37.3s/5m0s

running (4m40.0s), 10/10 VUs, 2006 complete and 0 interrupted iterations
default   [  93% ] 10 VUs  4m38.3s/5m0s

running (4m41.0s), 10/10 VUs, 2015 complete and 0 interrupted iterations
default   [  93% ] 10 VUs  4m39.3s/5m0s

running (4m42.0s), 10/10 VUs, 2022 complete and 0 interrupted iterations
default   [  93% ] 10 VUs  4m40.3s/5m0s

running (4m43.0s), 10/10 VUs, 2026 complete and 0 interrupted iterations
default   [  94% ] 10 VUs  4m41.3s/5m0s

running (4m44.0s), 10/10 VUs, 2034 complete and 0 interrupted iterations
default   [  94% ] 10 VUs  4m42.3s/5m0s

running (4m45.0s), 10/10 VUs, 2042 complete and 0 interrupted iterations
default   [  94% ] 10 VUs  4m43.3s/5m0s

running (4m46.0s), 10/10 VUs, 2048 complete and 0 interrupted iterations
default   [  95% ] 10 VUs  4m44.3s/5m0s

running (4m47.0s), 10/10 VUs, 2057 complete and 0 interrupted iterations
default   [  95% ] 10 VUs  4m45.3s/5m0s

running (4m48.0s), 10/10 VUs, 2064 complete and 0 interrupted iterations
default   [  95% ] 10 VUs  4m46.3s/5m0s

running (4m49.0s), 10/10 VUs, 2072 complete and 0 interrupted iterations
default   [  96% ] 10 VUs  4m47.3s/5m0s

running (4m50.0s), 10/10 VUs, 2077 complete and 0 interrupted iterations
default   [  96% ] 10 VUs  4m48.3s/5m0s

running (4m51.0s), 10/10 VUs, 2084 complete and 0 interrupted iterations
default   [  96% ] 10 VUs  4m49.3s/5m0s

running (4m52.0s), 10/10 VUs, 2093 complete and 0 interrupted iterations
default   [  97% ] 10 VUs  4m50.3s/5m0s

running (4m53.0s), 10/10 VUs, 2102 complete and 0 interrupted iterations
default   [  97% ] 10 VUs  4m51.3s/5m0s

running (4m54.0s), 10/10 VUs, 2108 complete and 0 interrupted iterations
default   [  97% ] 10 VUs  4m52.3s/5m0s

running (4m55.0s), 10/10 VUs, 2116 complete and 0 interrupted iterations
default   [  98% ] 10 VUs  4m53.3s/5m0s

running (4m56.0s), 10/10 VUs, 2124 complete and 0 interrupted iterations
default   [  98% ] 10 VUs  4m54.3s/5m0s

running (4m57.0s), 10/10 VUs, 2131 complete and 0 interrupted iterations
default   [  98% ] 10 VUs  4m55.3s/5m0s

running (4m58.0s), 10/10 VUs, 2138 complete and 0 interrupted iterations
default   [  99% ] 10 VUs  4m56.3s/5m0s

running (4m59.0s), 10/10 VUs, 2143 complete and 0 interrupted iterations
default   [  99% ] 10 VUs  4m57.3s/5m0s

running (5m00.0s), 10/10 VUs, 2150 complete and 0 interrupted iterations
default   [  99% ] 10 VUs  4m58.3s/5m0s

running (5m01.0s), 10/10 VUs, 2159 complete and 0 interrupted iterations
default   [ 100% ] 10 VUs  4m59.3s/5m0s

running (5m02.0s), 08/10 VUs, 2164 complete and 0 interrupted iterations
default ↓ [ 100% ] 10 VUs  5m0s


  █ THRESHOLDS 

    http_req_duration
    ✓ 'p(95)<3000' p(95)=233.05ms

    http_req_failed
    ✓ 'rate<0.05' rate=0.00%


  █ TOTAL RESULTS 

    checks_total.......: 2189    7.225938/s
    checks_succeeded...: 100.00% 2189 out of 2189
    checks_failed......: 0.00%   0 out of 2189

    ✓ /api/v1/accounts/self/courses status is 200
    ✓ /api/v1/courses/15/assignments status is 200
    ✓ /api/v1/courses/15/quizzes status is 200
    ✓ /api/v1/courses/16/assignments status is 200
    ✓ /api/v1/courses/16/quizzes status is 200
    ✓ /api/v1/courses/17/assignments status is 200
    ✓ /api/v1/courses/17/quizzes status is 200
    ✓ /api/v1/courses/18/assignments status is 200
    ✓ /api/v1/courses/18/quizzes status is 200
    ✓ /api/v1/courses/19/assignments status is 200
    ✓ /api/v1/courses/19/quizzes status is 200
    ✓ /api/v1/courses/20/assignments status is 200
    ✓ /api/v1/courses/20/quizzes status is 200
    ✓ /api/v1/courses/21/assignments status is 200
    ✓ /api/v1/courses/21/quizzes status is 200
    ✓ /api/v1/courses/22/assignments status is 200
    ✓ /api/v1/courses/22/quizzes status is 200
    ✓ modules status is 200
    ✓ quizzes status is 200
    ✓ assignments status is 200
    ✓ courses status is 200
    ✓ submission status is successful

    HTTP
    http_req_duration..............: avg=118.29ms min=25.53ms  med=89.53ms max=883.99ms p(90)=188.21ms p(95)=233.05ms p(99)=419.82ms
      { expected_response:true }...: avg=118.29ms min=25.53ms  med=89.53ms max=883.99ms p(90)=188.21ms p(95)=233.05ms p(99)=419.82ms
    http_req_failed................: 0.00%  0 out of 2189
    http_reqs......................: 2189   7.225938/s

    EXECUTION
    iteration_duration.............: avg=1.38s    min=541.56ms med=1.39s   max=2.79s    p(90)=1.97s    p(95)=2.05s    p(99)=2.15s   
    iterations.....................: 2172   7.169821/s
    vus............................: 8      min=0         max=10
    vus_max........................: 10     min=10        max=10

    NETWORK
    data_received..................: 27 MB  89 kB/s
    data_sent......................: 606 kB 2.0 kB/s



running (5m02.9s), 00/10 VUs, 2172 complete and 0 interrupted iterations
default ✓ [ 100% ] 10 VUs  5m0s